wsalmi/drone-tools/sdkconfig.defaults
# Drone Telemetry Monitor - Default SDK Configuration
# Target: ESP32-S3FN8 (M5 Stack Cardputer ADV)

# Target chip
CONFIG_IDF_TARGET="esp32s3"

# CPU frequency
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Flash configuration (8 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y

# PSRAM (external via StampS3A module)
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# FreeRTOS configuration
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_UNICORE=n
CONFIG_FREERTOS_TIMER_TASK_STACK_DEPTH=4096

# WiFi (for RemoteID scanning)
CONFIG_ESP_WIFI_ENABLED=y

# Bluetooth (for RemoteID BLE scanning)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# USB Host (for RTL-SDR)
CONFIG_USB_OTG_SUPPORTED=y
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=1024

# SPI configuration
CONFIG_SPI_MASTER_IN_IRAM=y

# UART (for GPS ATGM 336H)
CONFIG_UART_ISR_IN_IRAM=y

# SD/MMC card support
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Task watchdog
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Stack overflow detection
CONFIG_FREERTOS_CHECK_STACKOVERFLOW_CANARY=y
